# Задача 6:
# Вы пользуетесь общественным транспортом? Вероятно, вы
# расплачивались за проезд и получали билет с номером. Счастливым
# билетом называют такой билет с шестизначным номером, где сумма
# первых трех цифр равна сумме последних трех. Т.е. билет с номером
# 385916 – счастливый, т.к. 3+8+5=9+1+6. Вам требуется написать
# программу, которая проверяет счастливость билета.
# 385916 -> yes
# 123456 -> no
print('______вариант с автотестов__________________________________')
n = 385916

n1 = n // 100000
n2 = (n % 100000) // 10000
n3 = (n % 10000) // 1000
n4 = (n % 1000) // 100
n5 = (n % 100) // 10
n6 = n % 10
if n1 + n2 + n3 == n4 + n5 + n6:
    print('yes')
else:
    print('no')




# a = "385916"
# h_1 = int(a[0])+int(a[1])+int(a[2])
# h_2 = int(a[-3])+int(a[-2])+int(a[-1]) 
# counter = 0
# while a >= 0:
#     counter = counter + 1
#     a = a //10   
# print('количество цыфр ', counter)
# if counter == 6 and   h_1 == h_2:
#         print('Yes')
# else :
#         print('No')
       
              
        
# a1 = 385916

# a = 0
# for i in range(0,a1) :
#     a = i + i
#    # a1 = a1 //10   
# print('количество цыфр ', a)

a = "385916"

h_1 = int(a[-1])+int(a[-2])+int(a[-3])
print(h_1)
h_2 = int(a[2])+int(a[1])+int(a[0])     
print(h_2)     
if h_1 == h_2:
        print('Yes')
else :
        print('No') 

n = 385916
n1 = n // 100000
print(n1)
n2 = (n % 100000) // 10000
print(n2)
n3 = (n % 10000) // 1000
n4 = (n % 1000) // 100
n5 = (n % 100) // 10
n6 = n % 10
if n1 + n2 + n3 == n4 + n5 + n6:
    print('yes')
else:
    print('no')