# text = input()
# total = 0
# while text != 'stop':
#     text = input()
#     total += 1
    

# print('Сумма чисел равна', total)


print('-1-'*30)

# word = input()

# while word != 'КОНЕЦ':
#     print(word)
#     word = input()

print('-2-'*30)

# word = input()
# totl = 0

# while word != 'стоп' and word != 'хватит' and word != 'достаточно':
#     word = input()
#     totl += 1
# print(totl)

print('-3-'*30)


# На вход программе подается последовательность целых чисел, 
# каждое число на отдельной строке. Признаком окончания последовательности 
# является любое отрицательное число, при этом в саму последовательность оно не входит.
# Напишите программу, которая выводит сумму всех членов данной последовательности.


# n = int(input())

# totl = 0
# while n >= 0:
#     totl +=n
#     n = int(input())
    
# print(totl)


print('-4-'*30)
    

# n = int(input())

# totl = 0

# while n < 6 and n > 0:
   
#     if n == 5:
#         totl +=1
#     n = int(input())

# print(totl) 

print('-5-'*30)

# Всем известно, что ведьмак способен одолеть любых чудовищ,
# однако его услуги обойдутся недешево. К тому же ведьмак 
# не принимает купюры, он принимает только чеканные монеты.
# В мире ведьмака существуют монеты с номиналами 1,5,10,25.

# Напишите программу, которая определяет, какое минимальное
# количество чеканных монет нужно заплатить ведьмаку.


# n = int(input())

# totl = 0

# while n >= 25:
#     n = n - 25 
#     totl +=1
# while n >= 10:
#     n = n -10
#     totl +=1
# while n >= 5:
#     n = n -5
#     totl +=1
# while n >= 1:
#     n = n -1
#     totl +=1
                
# print(totl)        
