# Задача 32: Определить индексы элементов массива (списка),
# значения которых принадлежат заданному диапазону (т.е. не
# меньше заданного минимума и не больше заданного
# максимума)
# Ввод: [-5, 9, 0, 3, -1, -2, 1,
# 4, -2, 10, 2, 0, -9, 8, 10, -9,
# 0, -5, -5, 7]
# Вывод: [1, 9, 13, 14, 19]

print('__РАБОЧИЙ ВАРИАНТ ДЛЯ АВТОТЕСТОВ!!!!________________________________________________')
list_1 = [-5, 9, 0, 3, -1, -2, 1, 4, -2, 10, 2, 0, -9, 8, 10, -9, 0, -5, -5, 7]

min_num = 6
max_num = 13

for i in range(len(list_1)):
    if min_num<list_1[i]< max_num:
        print(i)
       # print(i, end=' ')